000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ШаблоныРегистрацииНовыхКарт/ШаблоныРегистрацииНовыхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныРегистрацииНовыхКарт</name>
  <resources>
    <name>ПроводитьОпросВладельцаПриРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаКарты</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДлинаКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоДиапазона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КонецДиапазона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ШаблоныРегистрацииНовыхКарт/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС


// Проверяет на соответствие введенным шаблонам 
//
// Параметры:
//  КодКарты - числовой или строковый код карты
//  ВидКарты - Перечисление ВидыИнформационныхКарт 
//  МассивШаблонов - массив возвращаемых шаблонов
//
// Возвращаемое значение:
//  Булево
//
Функция РезультатПроверкиСоответствияШаблонам(КодКарты, ВидКарты, МассивШаблонов) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ШаблоныКарт.ВидКарты,
	|	ШаблоныКарт.ПроводитьОпросВладельцаПриРегистрации,
	|	ШаблоныКарт.ДлинаКода,
	|	ШаблоныКарт.НачалоДиапазона КАК НачалоДиапазона,
	|	ШаблоныКарт.КонецДиапазона,
	|	ШаблоныКарт.ВидДисконтнойКарты,
	|	ШаблоныКарт.ГруппаКарты,
	|	ШаблоныКарт.НаименованиеШаблона
	|ИЗ
	|	РегистрСведений.ШаблоныРегистрацииНовыхКарт КАК ШаблоныКарт
	|ГДЕ
	|	ШаблоныКарт.ВидКарты = &ВидКарты
	|	И ШаблоныКарт.НачалоДиапазона <= &КодКарты
	|	И ШаблоныКарт.КонецДиапазона >= &КодКарты
	|	И ШаблоныКарт.ДлинаКода = &ДлинаКода
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоДиапазона");
	
	Запрос.УстановитьПараметр("ВидКарты",  ВидКарты);
	Запрос.УстановитьПараметр("КодКарты",  Строка(КодКарты));
	Запрос.УстановитьПараметр("ДлинаКода", СтрДлина(Строка(КодКарты)));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Ложь;
		
	Иначе	
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураПараметров = ОбщегоНазначенияРТ.СоздатьСтруктуруПоСтрокеВыборки(Результат, Выборка);
			МассивШаблонов.Добавить(СтруктураПараметров);
		КонецЦикла;
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции
